Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སེང་གེའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: After him, I venerated the Tathāgata Dharma­dhātu­siṃha­prabha.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དཔལ་གྱི་རི་རབ་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: After him, I venerated the Tathāgata Vairocana­śrī­sumeru.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་ཐམས་ཅད་སྣང་བར་མཛད་པའི་སེང་གེ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏེ། །
en: After him, I venerated the Tathāgata Sarva­samādhi­sāgarāvabhāsa­siṃha.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: After him, I venerated the Tathāgata Samanta­jñāna­prabhāsa.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་འོད་ཀུན་ཏུ་བསལ་བ་ཆོས་ཀྱི་གྲོང་ཁྱེར་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: After him, I venerated the Tathāgata Samanta­prajñābha­dharma­nagara­pradīpa.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་སངས་རྒྱས་བརྒྱ་པོ་འདི་དག་ལ་སྩོགས་པ། བསྐལ་པ་མདོག་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་ལ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བྱུང་སྟེ།
en: “In that way, noble one, there were these hundred buddhas and the other tathāgatas, as numerous as the atoms in Sumeru, who appeared in the kalpa called Vimalābha.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐ་མར་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གྲོང་ཁྱེར་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་རབ་ཏུ་སྣང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏེ།
en: “Noble one, the last of those tathāgatas as numerous as the atoms in Sumeru was a tathāgata by the name of Dharma­dhātu­nagarābha­jñāna­pradīpa­rāja.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ལས་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ལ་སྩོགས་པ་ཐ་མ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གྲོང་ཁྱེར་ཡེ་ཤེས་ཀྱི་འོད་ཀྱི་རབ་ཏུ་སྣང་བའི་བར་དེ་དག་ཐམས་ཅད་ཁོ་མོས་མཆོད་དོ། །
en: “In that way, noble one, I made offerings to those tathāgatas as numerous as the atoms in Sumeru, beginning with Sarva­dharma­sāgara­nirghoṣa­prabha­rāja and ending with Dharma­dhātu­nagarābha­jñāna­pradīpa­rāja.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཁོ་མོས་རིམ་གྲོར་བྱས་སོ། །
en: I attended to all those tathāgatas.

source: ཐམས་ཅད་ཀྱིས་ཆོས་བསྟན་པ་ཡང་ཐོས་སོ། །
en: I heard the Dharma taught by them all.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བསྟན་པ་ལའང་ཁོ་མོ་རབ་ཏུ་བྱུང་ངོ་། །
en: I entered homelessness in the teachings of all those tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བསྟན་པ་ཡང་ཁོ་མོས་ཡོངས་སུ་བཟུང་ངོ་། །
en: I possessed the teachings of all those tathāgatas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་འདི་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཐོབ་པའི་ཚུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་ཐོབ་བོ། །
en: I obtained the bodhisattva liberation called the entry into beautiful sounds and profound manifestations from all those tathāgatas, obtaining it in various ways.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུའང་ཁོ་མོས་སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: At the feet of all those tathāgatas I ripened an ocean of beings without edge or center.

source: དེ་ཚུན་ཆད་དུ་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་ཁོ་མོས་ཆོས་ཀྱི་ནན་ཏན་གྱིས་མཆོད་པ་བྱས་ཏེ།
en: “Since then, in practicing the Dharma I have made offerings to as many buddhas as have appeared throughout as many kalpas as there are atoms in a buddha realm.

source: རིགས་ཀྱི་བུ་དེ་ཕྱིན་ཆད་དུ་ཁོ་མོས་སེམས་ཅན་འཁོར་བའི་མུན་པ་ན་འཁོད་ཅིང་མི་ཤེས་པའི་གཉིད་ཀྱིས་ལོག་པ་རྣམས་ཀྱི་མེལ་ཚེ་བྱས་སོ། །
en: “Noble one, during that time, I have watched over beings as they slept in ignorance in the darkness of saṃsāra.

source: དེ་དག་གི་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡང་ཡོངས་སུ་བསྲུངས་སོ། །
en: I have guarded the cities of their minds.

source: དེ་དག་ཁམས་གསུམ་གྱི་གྲོང་ཁྱེར་ནས་གྱེན་དུ་བསྐྱོད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་རྡལ་དུ་ཡང་རབ་ཏུ་བཀོད་དོ། །
en: I have brought them up out of the city of the three realms and brought them into the city of omniscience.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་འཇིག་རྟེན་གྱི་ཚིག་ཀྱལ་པར་རྣམ་པར་བཟློག་པ། གཉིས་སུ་སྨྲ་བ་མེད་པ་ལ་རབ་ཏུ་འགོད་པ། བདེན་པ་ལ་རབ་ཏུ་གཞོག་པའི་མཐར་ཕྱིན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་དག་གི་ལམ་གྱི་རང་བཞིན་ཐམས་ཅད་ཐོགས་པ་མེད་པར་ཤེས་པ། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཐམས་ཅད་མངོན་པར་འཚང་རྒྱ་བར་དབང་བསྒྱུར་བ།
en: “Noble one, I know only this bodhisattva liberation called the entry into beautiful sounds and profound manifestations, which prevents meaningless worldly talk, establishes speech that is not dishonest, and concludes with it being firmly established in truth.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་དང་། ཚིག་རྒྱ་མཚོ་ལ་ཞུགས་པ། སྐད་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་པར་འདུ་བྱ་བ་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ཀྱི་གྲངས་དང་མིང་རྒྱ་མཚོའི་ཚུལ་དང་། ཆོ་ག་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའི་གཟུངས་རྒྱ་མཚོ་ལ་དབང་བསྒྱུར་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་ཏུ་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་སྤྱོད་པའི་མཐར་ཕྱིན་པར་བྱེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་བའམ། ཡོན་ཏན་བརྗོད་པ་འམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who know without impediment all languages, who understand all Dharma in each instant of mind, who comprehend all the words and languages of all beings, who are skilled in accumulating the entire ocean of languages, who are skilled in the ways and practices of an ocean of numbers and terms in all Dharmas, who have the power of an ocean of mental retention that engages with all the Dharma, who are skilled in creating clouds of Dharma that accord with the dispositions of all beings, and who have fully attained ripening and guiding all beings?

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པའི་ནན་ཏན་ཤེས་པར་བྱ་བ་འམ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་བླ་ན་མེད་པར་བརྩམས་པའི་སྦྱོར་བའམ། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཤིན་ཏུ་ཕྲ་བ་ཁོང་དུ་ཆུད་པའམ། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་གཏེར་དང་། མཛོད་རྣམ་པར་འབྱེད་པའི་ཁྱུ་མཆོག་གི་མཐུའམ། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་གཏམ་ལ་སེང་གེའི་ཁྲི་ཡོངས་སུ་མནན་པར་བྱ་བ་ཤེས་པར་ནུས་རེ་སྐན།
en: How could I know their practice of gathering all beings, their application to undertaking supreme bodhisattva activity, their comprehension of very subtle bodhisattva knowledge, their power of supremacy in opening the treasures and treasuries of bodhisattva Dharma, or their ascending the lion throne for teaching the bodhisattva Dharma?

source: སྐྱེས་བུ་དམ་པ་དེ་དག་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སའི་དཀྱིལ་འཁོར་གྱི་གཟུངས་ཡོངས་སུ་གནོན་པ་ཤ་སྟག་གོ །
en: It is because those excellent beings have all attained the retention of the domain of the level of the entire Dharma.

source: སོང་རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ཞབས་ཀྱི་དྲུང་འདི་ཉིད་དུ་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པར་བདེ་བར་གནས་པ་ཞེས་བྱ་བ་འདུག་སྟེ།
en: “Depart, noble one. Here at the feet of the Bhagavat Vairocana, there is the goddess of the night who has the name Sarva­vṛkṣpraphullana­sukha­saṃvāsā.

source: ཁོ་མོ་དང་རྒྱང་མི་རིང་བ་ཞིག་ན་འདུག་གིས། དེའི་གན་དུ་སོང་ལས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་དང་།
en: She is not far from me, so go to her and ask her, ‘How should bodhisattvas train in omniscience?

source: ཇི་ལྟར་ནན་ཏན་དུ་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགོད་པར་བྱེད་པ་དྲིས་ཤིག །
en: How should they practice it so as to bring all beings to omniscience?’ ”

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གྱིས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ས་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་འདི་ཉིད་བརྣན་ཏེ། བསྟན་པའི་ཕྱིར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། རྣམ་ཐར་གང་གིས་དུས་གསུམ་རྒྱལ་བ་མ་ལུས་དང་། །ཆོས་དབྱིངས་ཀུན་དུ་འབྱམ་ཀླས་མཐའ་དང་དབུས་མེད་པ། །
en: Then at that time, the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī, in order to teach further the bodhisattva liberation called the entry into beautiful sounds and profound manifestations, recited these verses to Sudhana, the head merchant’s son: “Profound and difficult to see is the bodhisattvas’ liberation By which they know every jina in the three times, The entire realm of phenomena without edge or center, And the complete extent of the characteristics of all cognition.

source: ཤེས་བྱེད་མཚན་ཉིད་ཀུན་གྱི་གཞིར་ཐུག་རྟོགས་པ་ཡི། །རྒྱལ་སྲས་རྣམས་ཀྱི་རྣམ་ཐར་ཟབ་ཅིང་བལྟ་བར་དཀའ། །ཚོགས་ལས་བྱུང་བའི་རྣམ་ཐར་ཚུལ་ནི་མཐའ་ཡས་ཏེ། །
en: {1} “The ways of the liberation that arise from the accumulations are infinite.

source: ཆོས་ཉིད་ཐོས་པས་ཚད་མེད་བསམ་དུ་མེད་པ་ཡིན། །
en: They are inconceivable and immeasurable, for they attain the true nature.

source: ཡོངས་སུ་འཕེལ་ཞིང་ཀུན་ཏུ་ཆགས་མེད་ཤུགས་དྲག་པར། །དུས་གསུམ་བྱམས་པའི་ཚུལ་གྱི་ལམ་ལ་འཇུག་པར་གྱིས། །
en: You should enter into the paths of the ways of love in the three times That completely increase power that is unimpeded.

source: འདི་ལྟར་སངས་རྒྱས་ཞིང་རྒྱུད་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། བསྐལ་པ་འདས་པའི་སྔ་རོལ་སྔོན་གྱི་ཞིང་བྱུང་བ། །འཇིག་རྟེན་ཁམས་ནི་ཆོས་འོད་སྤྲིན་གྱི་གྲོང་ཁྱེར་དཔལ། །བསྐུལ་པ་འབྱུང་བ་དྲི་མེད་མདོག་ཏུ་འོད་ཆེན་ནོ། །
en: {2} “There was a realm in the past, beyond as many kalpas As there are atoms that exist in a buddha realm; That glorious world realm was Dharmārci­megha­nagara, And there was a very bright kalpa called Vimalābha.

source: བསྐལ་པ་དེ་གཅིག་རྒྱལ་བའི་གདུང་ནི་རྒྱུན་མ་ཆད། །སངས་རྒྱས་རི་རབ་རྡུལ་ཕྲན་རབ་སྙེད་བྱུང་བར་གྱུར། །
en: {3} “In that one kalpa there appeared an unbroken succession of jinas, As many buddhas as there are atoms in Sumeru.

source: བདེ་གཤེགས་ཆོས་ཀྱི་རྒྱ་མཚོ་འོད་དབྱངས་རྒྱལ་པོ་ནི། །ཐོག་མར་བྱུང་སྟེ་དེ་དག་བསྐལ་པ་དང་པོ་བ། །
en: First to appear, the first in that kalpa, Was the Sugata Dharma­samudra­prabha­garjita­rāja.

source: རྒྱལ་བ་ཆོས་སྤྲིན་གྲོང་ཁྱེར་འོད་སྣང་རྒྱལ་པོ་ནི། །བདེ་གཤེགས་དེ་དག་ཀུན་གྱི་ཐ་མར་འཇིག་རྟེན་བྱུང་། །
en: {4} “The last of those tathāgatas to appear in the world Was the Jina Dharma­megha­nagarābha­pradīpa­rāja.

source: དེ་དག་ཀུན་གྱི་སྤྱན་སྔར་ཕྱིན་ཏེ་ཁོ་མོས་མཆོད། །
en: I came before them all and made offerings to them.

source: དེ་དག་ཀུན་ལས་ཆོས་ཀྱང་དགའ་བ་ཆེན་པོས་ཐོས། །
en: From them all I heard the Dharma with great joy.

source: ཁོ་མོས་ཐོག་མར་མཐོང་བ་གསེར་མདོག་འོད་མངའ་བ། །རྒྱ་མཚོའི་ཆོས་འོད་སྒྲོག་པའི་གསུང་གི་རྒྱལ་པོ་སྟེ། །མཚན་རབ་སུམ་ཅུ་གཉིས་ཀྱིས་ཡོངས་བརྒྱན་རི་བོ་འདྲ། །མཐོང་ནས་བདག་ནི་བདེ་གཤེགས་འགྱུར་སྙམ་བློ་གྲོས་གྱུར། །
en: {5} “First I saw, having a golden light, Dharma­samudra­prabha­garjita­rāja, Adorned with the thirty-two signs and resembling Meru, And seeing him I thought, ‘I shall become a sugata!’

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་ཁོ་མོས་མཐོང་མོད་ལ། །ཐམས་ཅད་མཁྱེན་ཉིད་འབྱམ་ཀླས་འབྱུང་བའི་རྒྱུ་རྐྱེན་ཀྱིས། །མཁའ་དབྱིངས་རྣམ་ཡངས་དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་ཅན། །རྒྱལ་བའི་སེམས་ཀྱི་དང་པོ་སྟོབས་ལྡན་རབ་ཏུ་སྐྱེས། །
en: {6} “The very moment I saw that tathāgata, There arose the powerful first aspiration to become a jina Who had the character of the true nature, as vast as space, Because of the all-pervading arising of omniscience.

source: སྙིང་རྗེ་བདུད་རྩིའི་རྒྱ་མཚོ་ཆེ་ལས་བྱུང་བ་དེས། །དུས་གསུམ་གཤེགས་པའི་བདེ་བར་གཤེགས་པ་ཐམས་ཅད་ཀུན། །རྒྱལ་སྲས་རྒྱ་མཚོས་བསྐོར་བ་མ་ལུས་ཐམས་ཅད་དང་། །སེམས་ཅན་རྒྱ་མཚོར་བཅས་པའི་རྒྱ་མཚོའི་ཞིང་ཡང་རྒྱས། །
en: {7} “All of the sugatas within the three times, Encircled by oceans of all the bodhisattvas, The extensive ocean of realms with their oceans of beings, Have arisen from the great ocean of the amrita of compassion.

source: ལུས་ཀྱིས་ཞིང་རྣམས་ཐམས་ཅད་མ་ལུས་ཁྱབ་བྱ་དང་། །འགྲོ་བ་ཀུན་གྱི་བསམ་པ་བཞིན་དུ་ལུས་བསྟན་ཕྱིར། །ཞིང་རྣམས་མ་ལུས་བསྐྱོད་ཅིང་སྣང་བར་བྱ་བ་དང་། །འགྲོ་བ་སྨིན་བྱའི་དོན་དུ་བདག་གིས་སེམས་ཀྱང་བསྐྱེད། །
en: {8} “I also aspired that in order to ripen beings I would pervade every single realm with my body, Manifest a body to beings in accordance with their aspirations, And illuminate and shake every single realm.

source: རྒྱལ་བ་གཉིས་པའི་སྤྱན་སྔར་ཁོ་མོ་ཕྱིན་ནས་ཀྱང་། །ཞིང་རྣམས་རྒྱ་མཚོ་བཅུ་བཞུགས་རྒྱལ་བའི་དབང་པོ་མཐོང་། །
en: {9} “I also came before the second buddha And saw jina lords in ten oceans of realms.

source: རྒྱལ་བ་ཐ་མ་མཐོང་ནས་ཞིང་གི་རྒྱ་མཚོ་རྣམས། །རྒྱ་མཚོའི་ཞིང་གི་རྡུལ་ཕྲན་རབ་སྙེད་བཞུགས་པ་མཐོང་། །
en: I saw the last jina within an ocean of realms As numerous as the atoms in an ocean of realms.

source: དེ་ཡི་ཚུ་རོལ་བསྐལ་པ་ཞིང་རྒྱུད་རྡུལ་སྙེད་དུ། །རྒྱལ་བ་འགྲོ་བའི་སྒྲོན་མ་ཇི་སྙེད་སྐྱེས་གྱུར་པ། །དེ་དག་ཐམས་ཅད་སྤྱན་སྔར་ཁོ་མོ་ཕྱིན་གྱུར་ཏེ། །རྣམ་ཐར་རྒྱ་མཚོའི་ཚུལ་འདི་སྤྱོད་ཚེ་མཆོད་པ་བྱས། །
en: {10} “Since then, during kalpas as numerous as a realm’s atoms, I have gone before and made offerings to All of the jinas, the lamps of the world, who appeared And purified an ocean of ways of liberation.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་ཐོབ་པ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་པ། གཟུངས་ཀྱི་སྒོ་རྒྱ་མཚོ་རྒྱ་ཆེན་པོ་ལས་བྱུང་བའི་སེམས་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པའི་སྣང་བ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་ཆེན་པོ་རྒྱ་མཚོ་ལ་ཞུགས་པ།
en: {11} Then Sudhana, the head merchant’s son, attained this bodhisattva liberation called the entry into beautiful sounds and profound manifestations, attained an endless, centerless ocean of samādhis, gained an understanding that arose from a vast ocean of gateways to retention, attained the great illumination of a bodhisattva’s higher cognitions, and entered an ocean of great discernment, and in his mind spread a vast ocean of powerful delight.

source: དགའ་བའི་ཤུགས་རྒྱ་མཚོ་ཤིན་དུ་ཡངས་པ་རྣམ་པར་འཕེལ་བའི་སེམས་དང་ལྡན་པ་དེས། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་ལ་ཚུལ་དང་མཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །ཁྱོད་ཀྱི་ཤེས་རབ་ཆོས་ཡངས་རྒྱ་མཚོ་ཀུན་ལ་སྤྱོད། །
en: He then praised the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī by reciting these appropriate verses: “Your wisdom is active in a vast ocean of the Dharma.

source: སྲིད་པའི་རྒྱ་མཚོ་མཐའ་དབུས་མེད་པར་ཁྱོད་ཀྱིས་སྤྱད། །
en: You practice in the centerless, endless ocean of existences.

source: ཡེ་ཤེས་ལུས་མཆོག་སྙིང་པོ་ཚེ་རིང་སྙུན་བྲལ་བ། །
en: The essence of your perfect wisdom body lives long without illness.

source: ལྷ་མོ་ཁྱོད་ནི་འཁོར་འདིར་བྱོན་ཅིང་རྣམ་པར་མཛེས། །
en: Goddess, you have come and beautified this assembly.

source: ཆོས་ཀྱི་རང་བཞིན་ནམ་མཁའ་ལྟ་བུ་ཐུགས་ཆུད་དེ། །
en: {12} “You have realized the nature of phenomena to be like space.

source: དུས་གསུམ་ཀུན་གྱི་ཚུལ་ཡང་ཆགས་མེད་ཐུགས་ཆུད་མཛད། །
en: You realize without impediment the ways of all three times.

source: ཐུགས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་ཚད་མེད་བསམ་ཡས་པའི། །དམིགས་པ་ཐམས་ཅད་རྟོག་པ་མི་མངར་འཇལ་བ་མཛད། །
en: In each instant of mind there are inconceivable, countless Perceptions, all of which are without conceptualization.

source: ཡེ་ཤེས་སྤྱན་མངའ་ཆོས་ཉིད་སེམས་ཅན་མེད་གཟིགས་ཀྱང་། །སེམས་ཅན་རྒྱ་མཚོ་མཐའ་ཡས་ཐུགས་རྗེས་གཟིགས་པ་མཛད། །
en: {13} “With your wisdom eyes you see the true nature in which there are no beings, Yet you perceive with compassion the infinite ocean of beings.

source: ཐུགས་ཀྱི་རྣམ་ཐར་ཤིན་ཏུ་ཡངས་ལ་འཇུག་མཛད་ཅིང་། །སེམས་ཅན་ཚད་མེད་འདུལ་ཞིང་ཡོངས་སུ་སྨིན་པར་མཛད། །
en: You enter the very vast liberation of your mind, And you guide and ripen countless beings.

source: ཁྱོད་ནི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་དཔྱད་ཚུལ་མཁྱེན་ཏེ། །
en: {14} “You know through analyzing the field of phenomena.

source: ཆོས་ཀྱི་རང་བཞིན་ཤེས་བྱའི་ཚུལ་ལ་རྣམ་སངས་རྒྱས། །
en: You have realized the way of knowing the nature of phenomena.

source: འཕགས་ལམ་དྲི་མ་མེད་པ་ཐམས་ཅད་ཡོངས་བསྒོམ་སྟེ། །
en: You meditate on all the stainless paths of the āryas.

source: འགྲོ་བ་མ་ལུས་རྣམ་པར་སྦྱོང་ཞིང་ཡོངས་སུ་འབྱུང་། །
en: You purify all beings without exception and liberate them.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དྲི་མེད་རྟོགས་མཛད་པས། །
en: {15} “You have realized the stainless wisdom of omniscience.

source: ཁྱོད་ནི་སེམས་ཅན་རྒྱ་མཚོའི་མཆོག་ལས་མངོན་པར་སྐྱེས། །
en: Goddess, you have become the supreme guide of beings.

source: ད་ནི་ཆོས་དབྱིངས་ཁོངས་ཆུད་སེམས་ཅན་ཀུན་ཁྱབ་པར། །ཆོས་རབ་བསྟན་ཅིང་འཇིག་རྟེན་འཇིགས་པ་ཞི་བར་མཛད། །
en: You pervade all beings within the realm of phenomena And teach them the Dharma and end all fear in the world.

source: ཁྱོད་ནི་རྣམ་པར་སྣང་མཛད་སྨོན་ལམ་ལམ་ཚུལ་གྱིས། །ཡང་དག་བཞུད་ཅིང་ཆགས་མེད་བློ་ཡང་དྲི་མེད་ལྡན། །
en: {16} “Goddess, through the way of the prayers of Vairocana, You have a vast, stainless, unimpeded, exact understanding.

source: ཐམས་ཅད་བགྲོད་པའི་རྒྱལ་བའི་སྟབས་ནི་ཐུགས་ཆུད་ཅིང་། །ཞིང་རྣམས་ཀུན་གྱི་རྒྱལ་བ་རྣམ་པར་འཕྲུལ་བ་གཟིགས། །
en: You have understood the power of the omnipresent jinas, And you see the miraculous manifestation of the jinas in all realms.

source: ཁྱོད་ཀྱི་ཐུགས་ནི་མཁའ་འདྲ་ཐུབ་པར་དཀའ་བ་སྟེ། །
en: {17} “Your mind is as invincible as space.

source: ཉོན་མོངས་ཀུན་གྱི་དྲི་མས་མ་གོས་སྔ་ནས་དག །
en: You are primordially pure, unstained by the stains of the kleśas.

source: དེར་ནི་དུས་གསུམ་བྱུང་བའི་ཞིང་རྣམས་ཐམས་ཅད་དང་། །སངས་རྒྱས་སྲས་དང་བཅས་པ་སེམས་ཅན་ཀུན་བཅས་འདུས། །
en: Within it appear all the realms of the three times And the assemblies of all buddhas and bodhisattvas.

source: སྐད་ཅིག་གཅིག་གིས་ཉིན་མཚན་ཡུད་དུ་ཟླ་བ་དང་། །སྐད་ཅིག་ཡུད་ཙམ་ལོ་དང་འདུ་འཇིག་བསྐལ་པ་དང་།
en: {18} “Within each instant there are days and nights and months, In each moment years and the creation and destruction of kalpas.

source: བསྐལ་པ་རྒྱ་མཚོ་མིང་གྲངས་རྒྱ་མཚོར་བཅས་པ་དང་། །འགྲོ་བ་རྣམས་ཀྱི་འདུ་ཤེས་རྒྱ་མཚོའང་ཐུགས་སུ་ཆུད། །
en: You know an ocean of kalpas, their ocean of names and numbers, And the ocean of the perceptions of beings, within each instant.

source: ཕྱོགས་རྣམས་ཀུན་གྱི་སེམས་ཅན་སྐྱེ་འཆི་ཇི་སྙེད་དང་། །གཟུགས་ཡོད་པ་དང་གཟུགས་མེད་འདུ་ཤེས་ཡོད་མེད་ཀྱི། །རྣམ་སྤྱོད་བདེན་པའི་ཚུལ་ནི་ཐུགས་སུ་ཆུད་མཛད་ཅིང་། །
en: {19} “You know the births and deaths of beings in all directions, Those with and without form, with and without perception, Those who follow the way of belief in reality.

source: དེ་དག་ལམ་བསྟན་བྱང་ཆུབ་མཆོག་ཏུ་འགོད་པ་མཛད། །
en: You show them the path and bring them to supreme enlightenment.

source: རྣམ་པར་སྣང་མཛད་སྨོན་ལམ་འདྲི་བའི་རིགས་ལས་འབྱུང་། །བདེ་གཤེགས་ཀུན་གྱི་སྐུ་གཅིག་ཚུལ་ལས་ཡང་དག་འཁྲུངས། །ཁྱོད་ནི་ཆོས་སྐུ་ཡོངས་དག་ཐུགས་ལ་ཆགས་མི་མངའ། །འཇིག་རྟེན་ཀུན་ཏུ་སྐུ་གཟུགས་ཡིད་བཞིན་སྟོན་པ་མཛད། །
en: {20} “Manifesting from the family of Vairocana’s net of prayers, Born from the single body of all the sugatas, Your unimpeded mind is the pure Dharma body, And you manifest your form body in all worlds according to aspirations.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: {21} Sudhana, the head merchant’s son, having praised the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī with these appropriate verses, bowed his head to the feet of the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī, circumambulated the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī.

source: བམ་པོ་བཅུ་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་དེ། དེ་བས་ཀྱང་རྒྱ་ཆེར་བསྒོམ་པ་དང་། ཡིད་ཆེས་པར་བྱ་བ་དང་།
en: Sarva­vṛkṣpraphullana­sukha­saṃvāsā Chapter 40 Sudhana, the head merchant’s son, further meditating on, believing in, and increasing the bodhisattva liberation called the entry into beautiful sounds and profound manifestations, went to where the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā was.

source: ཤིན་ཏུ་རྒྱས་པར་བྱེད་ཅིང་། མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པ་གང་ན་བ་དེར་ཕྱིན་ནས། མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པ་སྤོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གི་ཡལ་གའི་ཁང་པ་བརྩེགས་པ་ཞིག་ན། སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་ཤིང་གི་མྱུ་གུའི་སྙིང་པོ་ཅན་ཞིག་ལ་འདུག་སྟེ། མཚན་མོའི་ལྷ་མོ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་བསྐོར་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: He saw the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā seated upon a lion throne consisting of the saplings of precious trees, inside a kūṭāgāra made from the branches of all perfumed precious trees and encircled by an entourage of ten thousand night goddesses.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པའི། རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā and then stood before her.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་དང་། ཇི་ལྟར་སློབ་པ་དང་། ཇི་ལྟར་སྤྱོད་ཇི་ལྟར་སློབ་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བ་བདག་ལ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: With his hands placed together in homage, he said, “Goddess, I have developed the aspiration for the highest, complete enlightenment, and so I pray that you explain how bodhisattvas should practice bodhisattva conduct, how they should train in it, and how, having practiced and trained in it, they proceed toward omniscience!”

source: མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་མོའི་མཐུས་ནི་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཉི་མ་ནུབ་ཏུ་ཆ་བའི་ཚེ། པདྨོ་ཤིན་ཏ་རྒྱས་པ་རྣམས་ཀྱང་རྣམ་པར་པར་འགྱུར་རོ། །སྐྱེས་པ་དང་བུད་མེད་བཟའ་ཤིང་གི་ར་བ་ན་གནས་ཤིང་། དགའ་བར་རྩེ་བ་ལ་བརྩོན་པ་དག་ཀྱང་ཁྱིམ་དུ་འདོང་བའི་བློ་བསྐྱེད་དོ། །ལམ་དང་སྲང་ན་རྒྱུ་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཞག་གི་གནས་སེམས་ཤིང་ཚོལ་ཏེ་འགྲོ་བའི་གནས་ཐམས་ཅད་དུ་མངོན་པར་གཞོལ་བར་འགྱུར་རོ། །
en: The night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā said to Sudhana, the head merchant’s son, “Noble one, through my power, when the sun sets in the Sahā world realm, the lotus blossoms close, the men and women who are dedicated to delighting in pleasures in parks have the wish to return to their homes, the beings who travel along roads and narrow paths think of finding somewhere to stay for the night, and they turn their attention to all the safe dwellings for beings.

source: ནགས་ཚལ་དང་གསེབ་དང་། ཕུག་ལ་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱང་ནགས་ཚལ་དང་གསེབ་དང་ཕུག་ཏུ་འདོང་ངོ་། །
en: Those who dwell in forests, in mountain clefts, and in caves enter their forests, clefts, and caves.

source: ཤིང་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱང་ཤིང་གི་གནས་ལ་བརྟེན་པར་མངོན་པར་གཞོལ་ལོ། །
en: Those beings who dwell in trees think of returning to their homes in the trees.

source: ཁུང་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱང་ཁུང་དུ་འདོང་ངོ་། །
en: Those beings who dwell in holes return to their holes.

source: གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཡུལ་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱང་གྲོང་དང་གྲོང་ཁྱེར་དང་ལྗོངས་དང་ཡུལ་དུ་འདོང་ངོ་། །
en: Those beings who dwell in villages, towns, districts, and lands return to their villages, towns, districts, and lands.

source: ཆུ་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱང་ཆུར་འདོང་ངོ་། །
en: Those beings who dwell in water enter the water.

source: ཕྱོགས་གཞན་གྱི་ཡུལ་དུ་ཕྱིན་པའི་སེམས་ཅན་རྣམས་ཀྱང་ནུབ་མོ་བདེ་ཞིང་དགའ་བར་གནས་པའི་དོན་དུ་རང་རང་གི་ཡུལ་གྱི་ཕྱོགས་ཀྱི་བསམ་པ་སྐྱེད་དོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་། ཁོ་མོ་ནི་སྐྱེས་པ་དང་བུད་མེད་གཞོན་ནུ་དར་ལ་བབ་པ། དར་བའི་ཉམ་དྲོད་ཀྱིས་མྱོས་པ་དང་། །
en: Those beings who have gone to lands in other directions begin to think of the directions of their own lands in order to remain in a feeling of happiness during the night.
